Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkExtraPumpOutsideSet Property
 Flow calculations do not calculate this pump together with the other pumps as one equipment set. Verify the flow distribution and add the pump to the equipment set, if desired.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkExtraPumpOutsideSet { get; }
Public Shared ReadOnly Property NetworkExtraPumpOutsideSet As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkExtraPumpOutsideSet {
	FailureDefinitionId^ get ();
}
static member NetworkExtraPumpOutsideSet : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace